In [1]:
people = {
    "first": ["Deepak", 'Ashif', 'Akshay'], 
    "last": ["Kumar", 'md', 'Krishna'], 
    "email": ["deepakkumar@gmail.com", 'mdashif@email.com', 'akshaykrishna@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first     last                    email
0  Deepak    Kumar    deepakkumar@gmail.com
1   Ashif       md        mdashif@email.com
2  Akshay  Krishna  akshaykrishna@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['first_name', 'last_name', 'email']

In [7]:
df

  first_name last_name                    email
0     Deepak     Kumar    deepakkumar@gmail.com
1      Ashif        md        mdashif@email.com
2     Akshay   Krishna  akshaykrishna@email.com

In [8]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0     Deepak     Kumar    deepakkumar@gmail.com
1      Ashif        md        mdashif@email.com
2     Akshay   Krishna  akshaykrishna@email.com

In [9]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                    EMAIL
0     Deepak     Kumar    deepakkumar@gmail.com
1      Ashif        md        mdashif@email.com
2     Akshay   Krishna  akshaykrishna@email.com

In [10]:
df.columns = df.columns.str.replace('_',' ')
df

  FIRST NAME LAST NAME                    EMAIL
0     Deepak     Kumar    deepakkumar@gmail.com
1      Ashif        md        mdashif@email.com
2     Akshay   Krishna  akshaykrishna@email.com

In [11]:
df.columns = df.columns.str.replace(' ','_')
df

  FIRST_NAME LAST_NAME                    EMAIL
0     Deepak     Kumar    deepakkumar@gmail.com
1      Ashif        md        mdashif@email.com
2     Akshay   Krishna  akshaykrishna@email.com

In [13]:
df.rename(columns={'FIRST_NAME': 'first', 'LAST_NAME': 'last'}, inplace=True)
df

    first     last                    EMAIL
0  Deepak    Kumar    deepakkumar@gmail.com
1   Ashif       md        mdashif@email.com
2  Akshay  Krishna  akshaykrishna@email.com

In [15]:
df.loc[2] = ['Akshay', 'Singh', 'AkshaySingh@email.com']
df

    first   last                  EMAIL
0  Deepak  Kumar  deepakkumar@gmail.com
1   Ashif     md      mdashif@email.com
2  Akshay  Singh  AkshaySingh@email.com

In [17]:
df.loc[2, ['last', 'EMAIL']] = ['krishna', 'Akshaykrishna@email.com']
df

    first     last                    EMAIL
0  Deepak    Kumar    deepakkumar@gmail.com
1   Ashif       md        mdashif@email.com
2  Akshay  krishna  Akshaykrishna@email.com

In [24]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [18]:
df.loc[0, 'last'] = 'Sharma'

In [19]:
df

    first     last                    EMAIL
0  Deepak   Sharma    deepakkumar@gmail.com
1   Ashif       md        mdashif@email.com
2  Akshay  krishna  Akshaykrishna@email.com

In [20]:
df.at[2, 'last'] = 'Singh'

In [21]:
df

    first    last                    EMAIL
0  Deepak  Sharma    deepakkumar@gmail.com
1   Ashif      md        mdashif@email.com
2  Akshay   Singh  Akshaykrishna@email.com

In [24]:
filt = (df['EMAIL'] == 'mdashif@email.com')
df[filt]['last'] = 'MD.'    ## this doesnot work

C:\Users\deepak\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [25]:
df

    first    last                    EMAIL
0  Deepak  Sharma    deepakkumar@gmail.com
1   Ashif      md        mdashif@email.com
2  Akshay   Singh  Akshaykrishna@email.com

In [26]:
filt = (df['EMAIL'] == 'mdashif@email.com')
df.loc[filt, 'last'] = 'MD.'
df

    first    last                    EMAIL
0  Deepak  Sharma    deepakkumar@gmail.com
1   Ashif     MD.        mdashif@email.com
2  Akshay   Singh  Akshaykrishna@email.com

In [28]:
## to make a column lowercase
df['EMAIL'] = df['EMAIL'].str.lower()

In [29]:
df

    first    last                    EMAIL
0  Deepak  Sharma    deepakkumar@gmail.com
1   Ashif     MD.        mdashif@email.com
2  Akshay   Singh  akshaykrishna@email.com

In [30]:
## apply works on series and dataframes

## it will apply the function to every value of column

df['EMAIL'].apply(len)

0    21
1    17
2    23
Name: EMAIL, dtype: int64

In [32]:
def update_email(email):
    return email.upper()

In [33]:
## apply can accept any userdefined function
df['EMAIL'].apply(update_email)

0      DEEPAKKUMAR@GMAIL.COM
1          MDASHIF@EMAIL.COM
2    AKSHAYKRISHNA@EMAIL.COM
Name: EMAIL, dtype: object

In [35]:
df['email'] = df['EMAIL'].apply(update_email)

In [36]:
df

    first    last                    EMAIL                    email
0  Deepak  Sharma    deepakkumar@gmail.com    DEEPAKKUMAR@GMAIL.COM
1   Ashif     MD.        mdashif@email.com        MDASHIF@EMAIL.COM
2  Akshay   Singh  akshaykrishna@email.com  AKSHAYKRISHNA@EMAIL.COM

In [39]:
df.drop('EMAIL', inplace = True, axis=1)
df

    first    last                    email
0  Deepak  Sharma    DEEPAKKUMAR@GMAIL.COM
1   Ashif     MD.        MDASHIF@EMAIL.COM
2  Akshay   Singh  AKSHAYKRISHNA@EMAIL.COM

In [40]:
## apply can also accept lambda
df['email'] = df['email'].apply(lambda x: x.lower())

In [41]:
df

    first    last                    email
0  Deepak  Sharma    deepakkumar@gmail.com
1   Ashif     MD.        mdashif@email.com
2  Akshay   Singh  akshaykrishna@email.com

In [45]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [42]:
## applying apply on dataframe

df.apply(len)

## it would give the len of the row i.e. no of value present in that particular row

first    3
last     3
email    3
dtype: int64

In [43]:
## applying apply on dataframe

df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [44]:
len(df['email'])

3

In [45]:
## min value of each column
df.apply(pd.Series.min)

first                     Akshay
last                         MD.
email    akshaykrishna@email.com
dtype: object

In [46]:
df.apply(lambda x: x.min())

first                     Akshay
last                         MD.
email    akshaykrishna@email.com
dtype: object

In [47]:
## using applymap()   applying a method to each individual element of dataframe

df.applymap(len)

   first  last  email
0      6     6     21
1      5     3     17
2      6     5     23

In [53]:
df.applymap(str.upper)

    first    last                    email
0  DEEPAK  SHARMA    DEEPAKKUMAR@GMAIL.COM
1   ASHIF     MD.        MDASHIF@EMAIL.COM
2  AKSHAY   SINGH  AKSHAYKRISHNA@EMAIL.COM

In [54]:
df

    first    last                    email
0  Deepak  Sharma    deepakkumar@gmail.com
1   Ashif     MD.        mdashif@email.com
2  Akshay   Singh  akshaykrishna@email.com

In [57]:
## map works only on series

df['first'] = df['first'].map({'Deepak': 'Mr. Deepak', 'Akshay': 'AKKI'})
df

        first    last                    email
0  Mr. Deepak  Sharma    deepakkumar@gmail.com
1         NaN     MD.        mdashif@email.com
2        AKKI   Singh  akshaykrishna@email.com

In [56]:
df

    first    last                    email
0  Deepak  Sharma    deepakkumar@gmail.com
1   Ashif     MD.        mdashif@email.com
2  Akshay   Singh  akshaykrishna@email.com

In [66]:
df['first'] = df['first'].replace({na: 'Ashif'})

NameError: name 'na' is not defined

In [65]:
df

        first    last                    email
0  Mr. Deepak  Sharma    deepakkumar@gmail.com
1         NaN     MD.        mdashif@email.com
2        AKKI   Singh  akshaykrishna@email.com